# 1) Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
a = 123
b = 321
print('Значение а={}, Значение b={}'.format(a, b))
num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
num3 = int(input('Введите третье число: '))
string1 = input('Введите первую строку: ')
string2 = input('Введите вторую строку: ')
string3 = input('Введите третью строку: ')
print('Введеные числа: {}, {}, {}'.format(num1, num2, num3))
print('Введеные строки: "{}", "{}", "{}"'.format(string1, string2, string3))
